results/node2-raid-fix-memdisk-ceiling-20260709/full-memdisk/jfs-cold-mu150/fio-multi-seqread.txt
multi-seqread: (g=0): rw=read, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
...
fio-3.28
Starting 16 processes
multi-seqread: Laying out IO file (1 file / 4096MiB)
multi-seqread: Laying out IO file (1 file / 4096MiB)
multi-seqread: Laying out IO file (1 file / 4096MiB)
[...]

multi-seqread: (groupid=0, jobs=16): err= 0: pid=4079087: Thu Jul  9 15:28:23 2026
  read: IOPS=443, BW=111MiB/s (116MB/s)(64.0GiB/590441msec)
    clat (usec): min=48, max=549237, avg=35913.31, stdev=90018.91
     lat (usec): min=49, max=549237, avg=35913.60, stdev=90018.91
    clat percentiles (usec):
     |  1.00th=[   163],  5.00th=[   206], 10.00th=[   229], 20.00th=[   265],
     | 30.00th=[   306], 40.00th=[   379], 50.00th=[   469], 60.00th=[   570],
     | 70.00th=[  1991], 80.00th=[ 22938], 90.00th=[127402], 95.00th=[295699],
     | 99.00th=[392168], 99.50th=[413139], 99.90th=[446694], 99.95th=[463471],
     | 99.99th=[484443]
   bw (  KiB/s): min=43019, max=279107, per=100.00%, avg=113976.66, stdev=2229.51, samples=18820
   iops        : min=  168, max= 1090, avg=445.12, stdev= 8.71, samples=18820
  lat (usec)   : 50=0.01%, 100=0.07%, 250=16.26%, 500=37.02%, 750=12.76%
  lat (usec)   : 1000=1.27%
  lat (msec)   : 2=2.62%, 4=0.68%, 10=4.04%, 20=4.34%, 50=5.96%
  lat (msec)   : 100=3.81%, 250=4.46%, 500=6.70%, 750=0.01%
  cpu          : usr=0.02%, sys=0.68%, ctx=326417, majf=0, minf=3047
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=262144,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=111MiB/s (116MB/s), 111MiB/s-111MiB/s (116MB/s-116MB/s), io=64.0GiB (68.7GB), run=590441-590441msec