results/node2-raid-fix-memdisk-ceiling-20260709/full-memdisk/jfs-cold-mu150/fio-seqread-prep.txt
prep: (g=0): rw=write, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.28
Starting 1 process
prep: Laying out IO file (1 file / 4096MiB)

prep: (groupid=0, jobs=1): err= 0: pid=4018782: Thu Jul  9 15:06:38 2026
  write: IOPS=481, BW=120MiB/s (126MB/s)(4096MiB/33994msec); 0 zone resets
    clat (usec): min=258, max=12402, avg=1963.13, stdev=3516.55
     lat (usec): min=258, max=12402, avg=1963.55, stdev=3516.52
    clat percentiles (usec):
     |  1.00th=[  363],  5.00th=[  429], 10.00th=[  469], 20.00th=[  523],
     | 30.00th=[  553], 40.00th=[  586], 50.00th=[  603], 60.00th=[  627],
     | 70.00th=[  660], 80.00th=[  816], 90.00th=[10814], 95.00th=[11076],
     | 99.00th=[11600], 99.50th=[11600], 99.90th=[11731], 99.95th=[11863],
     | 99.99th=[12256]
   bw (  KiB/s): min=112128, max=295424, per=100.00%, avg=123575.40, stdev=37563.06, samples=67
   iops        : min=  438, max= 1154, avg=482.72, stdev=146.73, samples=67
  lat (usec)   : 500=15.40%, 750=62.95%, 1000=6.98%
  lat (msec)   : 2=1.64%, 4=0.04%, 20=13.00%
  cpu          : usr=5.68%, sys=10.57%, ctx=32787, majf=0, minf=82
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,16384,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=120MiB/s (126MB/s), 120MiB/s-120MiB/s (126MB/s-126MB/s), io=4096MiB (4295MB), run=33994-33994msec